<template>
    <NuxtLayout name="custom">
        <section class="section-about section-work">
            <div class="container">
                <div class="about">
                    <div class="work-subtext work-subtextst">
                        <strong class="work-subtitle">Реальные истории моряков..</strong><br/><br/>

                        <!-- ED TODO: remove on backend release -->
                        <strong>История повара Анны</strong><br><br>
                        Анна долгое время работала на государственной службе в надзорных органах, она имела приличное
                        звание и стабильную жизнь. Все было хорошо, но мечты о собственном доме не покидали ее. Анне
                        было 45 лет, когда она решилась пройти обучение в Приморском учебно-тренажерном центре (<a
                            href="http://maritimetc.ru/">http://maritimetc.ru/</a>) и начать свою карьеру в море. Она
                        успела поработать на добывающих судах, работала на судах под иностранным флагом в Азии.
                        Благодаря навыкам управления людьми она легко нашла общий язык с буфетчицей, которая тоже
                        обучалась в Приморском учебно-тренажерном центре (<a href="http://maritimetc.ru/">http://maritimetc.ru/</a>).
                        В один из рейсов она встретила своего будущего мужа, он был старшим механиком на этом судне. Ещё
                        год они работали вместе, ради уже общей цели – покупка дома для семьи. В 48 Анна исполнила все
                        свои мечты.
                        <br><br><strong>История матроса Димы</strong><br><br>
                        К 30-ти годам Дима пробовал себя в разных профессиях: он работал на стройке, был водителем
                        экспедитором, работал в рекламном агентстве и страховой компании – он занимался многим, но никак
                        не мог найти свое призвание и достойно обеспечить свою семью. Дима решил попробовать себя в море
                        и обучился в Владивостокском морском рыбопромышленном колледже (<a href="https://vmfcvl.ru/">https://vmfcvl.ru/</a>)
                        на матроса. Он устроился работать на краболовное судно. Уже в первом рейсе он понял, что именно
                        в море у него всё получится. Он стал изучать процесс добычи, его любопытство заменил тралмастер
                        и стал обучать его тому, что знал сам. После рейса Дима поступил в Дальрыбвтуз (<a
                            href="https://dalrybvtuz.ru/">https://dalrybvtuz.ru/</a>) заочно и продолжал работать.
                        Прошло 3 года, сейчас Дима сам работает тралмастером на краболовном судне в одной из лучших
                        компаний Дальнего Востока. Но главное – он нашел свое призвание.
                        <br><br><strong>История матроса Андрея</strong><br><br>
                        Андрей, как и многие парни, окончив 9 классов школы ушел в техникум учиться на
                        газоэлектросварщика. Когда он закончил обучение, то как раз достиг призывного возраста и пошел
                        служить в армию. По распределению он попал в особые войска – ему понравилось, поэтому он остался
                        служить по контракту еще на год. В 21 год Андрей вернулся в родной город. Все его друзья уже
                        получили образование, устроились на работу, а он не знал куда податься. Случайно он узнал, что в
                        крупнейшей транспортной компании ФЕСКО (<a href="https://www.fesco.ru/ru/">https://www.fesco.ru/ru/</a>)
                        ,есть вакансии газоэлектросварщика. В отделе кадров этой компании ему сообщили, что готовы за
                        свой счет переквалифицировать его на должность матроса-гэс с последующим трудоустройством на
                        контейнеровоз. Спустя всего 2 месяца Андрей пошел в свой первый рейс в Шанхай.
                        <br><br><strong>История моториста Игоря</strong><br><br>
                        Долгое время Игорь работал механиком в автосервисе: ему всегда нравилось разбирать и собирать
                        машины. Позже с другом они организовали бизнес - стали привозить и продавать автомобили из
                        Японии. Продажи шли хорошо, но внешнеэкономические факторы изменили эту сферу так, что
                        заниматься машинами стало невыгодно. Тогда Игорь решил начать все с нуля: он обучился в
                        Приморском учебно-тренажерном центре (<a href="http://maritimetc.ru/">http://maritimetc.ru/</a>)на
                        моториста и начал работать в море. Его знания по достоинству оценили на судне и предложили
                        должность вахтенного механика. Поэтому этом году Игорь поступил в МГУ Невельского (<a
                            href="https://www.msun.ru/">https://www.msun.ru/</a>) на механика заочно и продолжает
                        работать в должности. Все получилось.
                        <br><br><strong>История штурмана Антона</strong><br><br>
                        По стопам отца Антон решил связать свою жизнь с морем и пошел учиться в Дальрыбвтуз (<a
                            href="https://dalrybvtuz.ru/">https://dalrybvtuz.ru/</a>). Старт его карьеры начался с
                        практики в должности матроса на добывающем судне, позже он работал на торговых судах в
                        Азиатско-Тихоокеанском регионе, в должности штурмана он работал на танкерах и обошел практически
                        весь мир: пересекая океаны, обошел Африку, часто посещал Канаду и Европу. Благодаря знаниям,
                        полученным в Дальрыбвтузе (<a href="https://dalrybvtuz.ru/">https://dalrybvtuz.ru/</a>), и
                        огромному практическому опыту, его пригласили на руководящую должность в судоходную компанию.
                        Антон все так же управляет вверенными ему судами, но уже из своего кабинета.
                        <br><br><strong>История электрика Егора</strong><br><br>
                        Базое образование электрика Егор получил в техникуме. От друга он узнал, что работа в море
                        оплачивается гораздо больше, чем на суше. Тогда Егор решил получить дополнительные морские
                        документы в Владивостокском морском рыбопромышленном колледже (<a href="https://vmfcvl.ru/">https://vmfcvl.ru/</a>)
                        и устроился на добывающее судно. Зарплата действительно стала гораздо больше, и работа ему
                        нравилась. Спустя 2 года по личным причинам он был вынужден отказаться от длительных рейсов.
                        Однако, оказалось, что есть специальные морские ремонтные бригады с техническим штатом
                        сотрудников. Такие бригады работают в порту или выезжают на 2-3 недели на судно, чтобы
                        произвести ремонт и вернуться на берег. Уровень зарплаты чуть ниже, чем в рейсе, но более
                        достойный, чем на суше. Теперь Егор занимается ремонтом судов, кстати, в должности
                        электромеханика.
                    </div>

                    <template v-for="(item, i) in history" :key="'history-item-' + i">
                        <strong>{{ item.title }}</strong
                        ><br/><br/>
                        {{ item.content }}
                        <br/><br/>
                    </template>

                </div>
            </div>
        </section>
    </NuxtLayout>
</template>

<script setup>
    import api from "@/api/api";

    const history = ref(null);

    async function getHistory() {
        const {data} = await api.get("/real-history");
        history.value = data;
    }

    onMounted(async () => {
        await getHistory();
    });
</script>

<style lang="scss" scoped></style>
